The plan is saved for 59d7a218b54f360571a7a6fe2edd95f0c0b7401f.
Use `/apply` to apply the plan and merge this PR.
<details><summary>Show output</summary>

```
warning: file 'nixpkgs' was not found in the Nix search path (add it using $NIX_PATH or -I), at (string):1:9; will use bash from your environment
module.staging.module.database.random_password.password: Refreshing state... [id=none]
module.staging.module.minio.random_password.secret_key: Refreshing state... [id=none]
module.staging.module.database.random_password.username: Refreshing state... [id=none]
module.staging.module.minio.random_password.access_key: Refreshing state... [id=none]
sakuracloud_internet.router: Refreshing state... [id=113300794884]
module.staging.module.minio.sakuracloud_packet_filter.switch: Refreshing state... [id=113300794887]
module.staging.sakuracloud_switch.internal: Refreshing state... [id=113300794881]
module.staging.module.database.sakuracloud_disk.data_disk: Refreshing state... [id=113300794882]
module.staging.module.database.sakuracloud_packet_filter.switch: Refreshing state... [id=113300794886]
module.staging.module.minio.sakuracloud_disk.data_disk: Refreshing state... [id=113300794883]
module.staging.module.nightly.sakuracloud_packet_filter.external: Refreshing state... [id=113300794889]
module.staging.module.beta.sakuracloud_packet_filter.external: Refreshing state... [id=113300794888]
cloudflare_record.beta: Refreshing state... [id=ee9570ffbeeef08cfdfdc12b24ce2852]
cloudflare_record.nightly: Refreshing state... [id=dbdd5fa4aad0938caf206439e9f8709d]
module.staging.module.minio.module.nixos_minio.sakuracloud_archive.nixos: Refreshing state... [id=113300794895]
module.staging.module.minio.sakuracloud_disk.disk: Refreshing state... [id=113300794911]
module.staging.module.minio.sakuracloud_server.minio: Refreshing state... [id=113300794913]
module.staging.module.database.module.nixos_database.sakuracloud_archive.nixos: Refreshing state... [id=113300794897]
module.staging.module.database.sakuracloud_disk.disk: Refreshing state... [id=113300794917]
module.staging.module.database.sakuracloud_server.database: Refreshing state... [id=113300794920]
module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300825856]
module.staging.module.nightly.sakuracloud_disk.server_disk: Refreshing state... [id=113300825899]
module.staging.module.nightly.sakuracloud_server.server: Refreshing state... [id=113300825906]
module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300825857]
module.staging.module.beta.sakuracloud_disk.server_disk: Refreshing state... [id=113300825898]
module.staging.module.beta.sakuracloud_server.server: Refreshing state... [id=113300825903]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.module.beta.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300825898" -> (known after apply)
        name              = "sos21_staging_server_disk"
      ~ server_id         = "113300825903" -> (known after apply)
      ~ source_archive_id = "113300825857" -> (known after apply) # forces replacement
        tags              = [
            "sos21_beta",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.beta.sakuracloud_server.server will be updated in-place
  ~ resource "sakuracloud_server" "server" {
      ~ disks            = [
          - "113300825898",
        ] -> (known after apply)
        id               = "113300825903"
        name             = "sos21_staging_server"
        tags             = [
            "sos21_beta",
            "sos21_server",
            "sos21_staging",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.staging.module.nightly.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300825899" -> (known after apply)
        name              = "sos21_staging_server_disk"
      ~ server_id         = "113300825906" -> (known after apply)
      ~ source_archive_id = "113300825856" -> (known after apply) # forces replacement
        tags              = [
            "sos21_nightly",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.nightly.sakuracloud_server.server will be updated in-place
  ~ resource "sakuracloud_server" "server" {
      ~ disks            = [
          - "113300825899",
        ] -> (known after apply)
        id               = "113300825906"
        name             = "sos21_staging_server"
        tags             = [
            "sos21_nightly",
            "sos21_server",
            "sos21_staging",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/bcanjdfnzixk8lyvdxrwzamxs6ldw0fl-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" -> "modules/sakuracloud_archive_nixos_custom/.built_image/88p884gpg80ncz57fndfzp6dj5mk0b21-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" # forces replacement
      ~ description  = "bcanjdfnzixk8lyvdxrwzamxs6ldw0fl-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1" -> "88p884gpg80ncz57fndfzp6dj5mk0b21-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1"
      + hash         = (known after apply) # forces replacement
      ~ id           = "113300825857" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_beta",
            "sos21_staging",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/x1qw8gakmgrgvaqyxyvpzdyrj1q6c20a-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" -> "modules/sakuracloud_archive_nixos_custom/.built_image/ls16a8kj0lcy2zi412875jraljm632xy-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" # forces replacement
      ~ description  = "x1qw8gakmgrgvaqyxyvpzdyrj1q6c20a-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1" -> "ls16a8kj0lcy2zi412875jraljm632xy-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1"
      + hash         = (known after apply) # forces replacement
      ~ id           = "113300825856" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_nightly",
            "sos21_staging",
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```
</details>